Revit 2027 API
DuctLiningType.IsValidRoughness Method
 Identifies if the input roughness is valid.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRoughness(
	double roughness
)
Public Function IsValidRoughness (
	roughness As Double
) As Boolean
public:
bool IsValidRoughness(
	double roughness
)
member IsValidRoughness :
        roughness : float -> bool
Parameters
roughness Double
 The roughness to check.
Return Value
Boolean
 True if the value is acceptable, false otherwise.
Remarks
 Roughness should be at least equal to or larger than 0.
See Also
Reference
DuctLiningType Class
Autodesk.Revit.DB.Mechanical Namespace